output/posts/klib/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>klib | chimez's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://chimez.github.io/posts/klib/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="chimez">
<link rel="prev" href="../cython/" title="cython" type="text/html">
<link rel="next" href="../xxhash/" title="xxhash" type="text/html">
<meta property="og:site_name" content="chimez's blog">
<meta property="og:title" content="klib">
<meta property="og:url" content="https://chimez.github.io/posts/klib/">
<meta property="og:description" content='klib: 轻量级 c 头文件库


attractivechaos/klib




khash.h


快速轻量的哈希表库


   #include "khash.h"

   typedef int kh_myname_key_t;
   typedef int kh_myname_value_t;

   kh_int_t 
   kh_myname_hash_func(kh_mynam'>
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-08-07T00:19:52+08:00">
<meta property="article:tag" content="C">
<meta property="article:tag" content="khash">
<meta property="article:tag" content="klib">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">chimez's blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">klib</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    chimez
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-08-07T00:19:52+08:00" itemprop="datePublished" title="2021-08-07 00:19">2021-08-07 00:19</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org7e15f53" class="outline-2">
<h2 id="org7e15f53">klib: 轻量级 c 头文件库</h2>
<div class="outline-text-2" id="text-org7e15f53">
<p>
<a href="https://github.com/attractivechaos/klib">attractivechaos/klib</a>
</p>
</div>

<div id="outline-container-org07d9425" class="outline-3">
<h3 id="org07d9425">khash.h</h3>
<div class="outline-text-3" id="text-org07d9425">
<p>
快速轻量的哈希表库
</p>

<div class="highlight"><pre><span></span><span class="w">   </span><span class="cp">#include</span><span class="w"> </span><span class="cpf">"khash.h"</span><span class="cp"></span>

<span class="w">   </span><span class="k">typedef</span><span class="w"> </span><span class="kt">int</span><span class="w"> </span><span class="n">kh_myname_key_t</span><span class="p">;</span><span class="w"></span>
<span class="w">   </span><span class="k">typedef</span><span class="w"> </span><span class="kt">int</span><span class="w"> </span><span class="n">kh_myname_value_t</span><span class="p">;</span><span class="w"></span>

<span class="w">   </span><span class="n">kh_int_t</span><span class="w"> </span>
<span class="w">   </span><span class="nf">kh_myname_hash_func</span><span class="p">(</span><span class="n">kh_myname_key_t</span><span class="w"> </span><span class="n">key</span><span class="p">){</span><span class="w"></span>
<span class="w">       </span><span class="k">return</span><span class="w"> </span><span class="n">HASH</span><span class="p">(</span><span class="n">key</span><span class="p">);</span><span class="w"></span>
<span class="w">   </span><span class="p">}</span><span class="w"></span>

<span class="w">   </span><span class="kt">int</span><span class="w"> </span>
<span class="w">   </span><span class="nf">kh_myname_hash_equal</span><span class="p">(</span><span class="n">kh_myname_key_t</span><span class="w"> </span><span class="n">key_1</span><span class="p">,</span><span class="w"> </span><span class="n">kh_myname_key_t</span><span class="w"> </span><span class="n">key_2</span><span class="p">){</span><span class="w"></span>
<span class="w">       </span><span class="k">return</span><span class="w"> </span><span class="n">key_1</span><span class="w"> </span><span class="o">==</span><span class="w"> </span><span class="n">key_2</span><span class="p">;</span><span class="w"></span>
<span class="w">   </span><span class="p">}</span><span class="w"></span>

<span class="w">   </span><span class="n">KHASH_INIT</span><span class="p">(</span><span class="n">myname</span><span class="p">,</span><span class="w"> </span><span class="n">kh_myname_key_t</span><span class="p">,</span><span class="w"> </span><span class="n">kh_myname_value_t</span><span class="p">,</span><span class="w"> </span><span class="mi">1</span><span class="p">,</span><span class="w"> </span><span class="n">kh_myname_hash_func</span><span class="p">,</span><span class="w"> </span><span class="n">kh_myname_hash_equal</span><span class="p">)</span><span class="w"></span>

<span class="w">   </span><span class="kt">int</span><span class="w"> </span>
<span class="w">   </span><span class="n">main</span><span class="p">(){</span><span class="w"></span>

<span class="w">       </span><span class="n">khiter_t</span><span class="w"> </span><span class="n">k</span><span class="p">;</span><span class="w">	</span>
<span class="w">       </span><span class="n">khash_t</span><span class="p">(</span><span class="n">myname</span><span class="p">)</span><span class="w"> </span><span class="o">*</span><span class="n">h</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">kh_init</span><span class="p">(</span><span class="n">myname</span><span class="p">);</span><span class="w"></span>

<span class="w">       </span><span class="c1">// 存入数据</span>
<span class="w">       </span><span class="k">for</span><span class="w"> </span><span class="p">(</span><span class="kt">int</span><span class="w"> </span><span class="n">i</span><span class="o">=</span><span class="mi">0</span><span class="p">;</span><span class="w"> </span><span class="n">i</span><span class="o">&lt;</span><span class="mi">10</span><span class="p">;</span><span class="w"> </span><span class="o">++</span><span class="n">i</span><span class="p">){</span><span class="w"></span>
<span class="w">	   </span><span class="n">kh_myname_key_t</span><span class="o">*</span><span class="w"> </span><span class="n">key</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">calloc</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span><span class="w"> </span><span class="k">sizeof</span><span class="p">(</span><span class="n">kh_myname_key_t</span><span class="p">));</span><span class="w">			</span>
<span class="w">	   </span><span class="o">*</span><span class="n">key</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">i</span><span class="p">;</span><span class="w"></span>

<span class="w">	   </span><span class="kt">int</span><span class="w"> </span><span class="n">ret</span><span class="p">;</span><span class="w"></span>
<span class="w">	   </span><span class="n">k</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">kh_put</span><span class="p">(</span><span class="n">myname</span><span class="p">,</span><span class="w"> </span><span class="n">h</span><span class="p">,</span><span class="w"> </span><span class="n">key</span><span class="p">,</span><span class="w"> </span><span class="o">&amp;</span><span class="n">ret</span><span class="p">);</span><span class="w">			</span>
<span class="w">	   </span><span class="n">kh_value</span><span class="p">(</span><span class="n">h</span><span class="p">,</span><span class="w"> </span><span class="n">k</span><span class="p">)</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">i</span><span class="w"> </span><span class="o">+</span><span class="w"> </span><span class="mi">3</span><span class="p">;</span><span class="w">			</span>
<span class="w">       </span><span class="p">}</span><span class="w"></span>

<span class="w">       </span><span class="c1">// 读取，修改，删除</span>
<span class="w">       </span><span class="k">for</span><span class="w"> </span><span class="p">(</span><span class="kt">int</span><span class="w"> </span><span class="n">i</span><span class="o">=</span><span class="mi">0</span><span class="p">;</span><span class="w"> </span><span class="n">i</span><span class="o">&lt;</span><span class="mi">10</span><span class="p">;</span><span class="w"> </span><span class="o">++</span><span class="n">i</span><span class="p">){</span><span class="w"></span>
<span class="w">	   </span><span class="kt">int</span><span class="w"> </span><span class="n">key</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">i</span><span class="p">;</span><span class="w"></span>
<span class="w">	   </span><span class="n">k</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">kh_get</span><span class="p">(</span><span class="n">myname</span><span class="p">,</span><span class="w"> </span><span class="n">h</span><span class="p">,</span><span class="w"> </span><span class="n">key</span><span class="p">);</span><span class="w">			</span>

<span class="w">	   </span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="o">!</span><span class="n">kh_exist</span><span class="p">(</span><span class="n">h</span><span class="p">,</span><span class="n">k</span><span class="p">)</span><span class="w"> </span><span class="o">||</span><span class="w"> </span><span class="n">k</span><span class="o">==</span><span class="w"> </span><span class="n">kh_end</span><span class="p">(</span><span class="n">h</span><span class="p">))</span><span class="w"></span>
<span class="w">	       </span><span class="n">printf</span><span class="p">(</span><span class="s">"not exits!</span><span class="se">\n</span><span class="s">"</span><span class="p">);</span><span class="w"></span>
<span class="w">	   </span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="n">kh_value</span><span class="p">(</span><span class="n">h</span><span class="p">,</span><span class="w"> </span><span class="n">k</span><span class="p">)</span><span class="w"> </span><span class="o">!=</span><span class="w"> </span><span class="n">i</span><span class="o">+</span><span class="n">j</span><span class="p">)</span><span class="w">			</span>
<span class="w">	       </span><span class="n">printf</span><span class="p">(</span><span class="s">"wrong value!</span><span class="se">\n</span><span class="s">"</span><span class="p">);</span><span class="w"></span>

<span class="w">	   </span><span class="n">kh_del</span><span class="p">(</span><span class="n">myname</span><span class="p">,</span><span class="w"> </span><span class="n">h</span><span class="p">,</span><span class="w"> </span><span class="n">k</span><span class="p">);</span><span class="w">			</span>
<span class="w">	   </span><span class="n">free</span><span class="p">(</span><span class="n">kh_key</span><span class="p">(</span><span class="n">h</span><span class="p">,</span><span class="w"> </span><span class="n">k</span><span class="p">));</span><span class="w">			</span>
<span class="w">       </span><span class="p">}</span><span class="w"></span>

<span class="w">       </span><span class="n">kh_destroy</span><span class="p">(</span><span class="n">myname</span><span class="p">,</span><span class="w"> </span><span class="n">h</span><span class="p">);</span><span class="w">	</span>

<span class="w">       </span><span class="k">return</span><span class="w"> </span><span class="mi">0</span><span class="p">;</span><span class="w"></span>
<span class="w">   </span><span class="p">}</span><span class="w"></span>
</pre></div>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/c/" rel="tag">C</a></li>
            <li><a class="tag p-category" href="../../categories/khash/" rel="tag">khash</a></li>
            <li><a class="tag p-category" href="../../categories/klib/" rel="tag">klib</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../cython/" rel="prev" title="cython">Previous post</a>
            </li>
            <li class="next">
                <a href="../xxhash/" rel="next" title="xxhash">Next post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2021         <a href="mailto:chimez@163.com">chimez</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
